; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	spectrograph0 - mode
	image1 - mode
	infrared2 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	GroundStation8 - direction
	GroundStation1 - direction
	Star3 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star9)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
	(supports instrument2 infrared2)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star9)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation2)
)
(:goal (and
	(pointing satellite0 Phenomenon16)
	(pointing satellite1 GroundStation8)
	(pointing satellite2 Star0)
	(have_image Star10 spectrograph0)
	(have_image Planet11 spectrograph0)
	(have_image Planet12 image1)
	(have_image Planet13 infrared2)
	(have_image Phenomenon14 spectrograph0)
	(have_image Planet15 spectrograph0)
	(have_image Phenomenon16 infrared2)
))

)

; plan
1. (turn_to satellite2 star0 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 star0)
   goals met: 1 of 10
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 10
3. (calibrate satellite1 instrument1 star9)
   added: (calibrated instrument1)
   goals met: 1 of 10
4. (turn_to satellite1 planet11 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 planet11)
   goals met: 1 of 10
5. (take_image satellite1 planet11 instrument1 spectrograph0)
   added: (have_image planet11 spectrograph0)
   goals met: 2 of 10
6. (turn_to satellite1 phenomenon16 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 phenomenon16)
   goals met: 2 of 10
7. (take_image satellite1 phenomenon16 instrument1 infrared2)
   added: (have_image phenomenon16 infrared2)
   goals met: 3 of 10
8. (turn_to satellite1 phenomenon14 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 phenomenon14)
   goals met: 3 of 10
9. (turn_to satellite0 phenomenon16 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 phenomenon16)
   goals met: 4 of 10
10. (take_image satellite1 phenomenon14 instrument1 spectrograph0)
   added: (have_image phenomenon14 spectrograph0)
   goals met: 5 of 10
11. (turn_to satellite1 planet12 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 planet12)
   goals met: 5 of 10
12. (take_image satellite1 planet12 instrument1 image1)
   added: (have_image planet12 image1)
   goals met: 6 of 10
13. (turn_to satellite1 planet13 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet13)
   goals met: 6 of 10
14. (take_image satellite1 planet13 instrument1 infrared2)
   added: (have_image planet13 infrared2)
   goals met: 7 of 10
15. (turn_to satellite1 planet15 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 planet15)
   goals met: 7 of 10
16. (take_image satellite1 planet15 instrument1 spectrograph0)
   added: (have_image planet15 spectrograph0)
   goals met: 8 of 10
17. (turn_to satellite1 star10 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 star10)
   goals met: 8 of 10
18. (take_image satellite1 star10 instrument1 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 9 of 10
19. (turn_to satellite1 groundstation8 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 groundstation8)
   goals met: 10 of 10
